# Вычислить число Пи c заданной точностью d
# *Пример:* 
# - при d = 0.001, π = 3.141
# - при d = 0.0001, π = 3.1415  



from math import pi

a = str(input('Введите точность числа Pi": '))
b = a[2:len(a)]

print(round(pi, len(b)))